common/ABL/system/controlDict.0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       superDeliciousVanilla;

  libs              ("libSOWFAboundaryConditions.so" "libSOWFAincompressibleTurbulenceModels.so");

  startFrom         startTime;

  startTime         0.0;

  stopAt            endTime;

  endTime           22000.0; // Will be overwritten by values in runscript.solve.0. Modify there.

  deltaT            0.5;

  writeControl      adjustableRunTime;

  writeInterval     2000.0;  // Will be overwritten by values in runscript.solve.0. Modify there.

  purgeWrite        0;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  uncompressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    yes;

  maxCo             0.75;

  maxDeltaT         25.0;

  functions
  {
    #includeFunc Q          // Calculates the second invariant of the velocity gradient tensor.
    #includeFunc vorticity  // Calculates the vorticity field, i.e. the curl of the velocity field.
    #include "sampling/planarAveraging"
    #include "sampling/boundaryData"
    #include "sampling/temporalAverages"
    #include "sampling/slicesPrecursor"
  }

// ************************************************************************* //

